In [2]:
from sqlalchemy import create_engine
import pandas as pd

In [3]:
#conn= create_engine('mysql+pymysql://UserNameforSQLDB:passwordForSqlDB@localhost:portNumber or ip address /databasename')
conn = create_engine('mysql+pymysql://root:password@localhost/hr')

In [4]:
query=('select * from employees')

In [6]:
data=pd.read_sql(query,conn)

In [7]:
data.head()

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,1987-06-17,AD_PRES,24000.0,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,1989-09-21,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,1993-01-13,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,1990-01-03,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,1991-05-21,IT_PROG,6000.0,NaN,103.0,60.0

In [ ]:
import sqlalchemy
sqlalchemy.__version__

# get the first name and last name of all the employees where salary is greater than 17000 in a new dataframe?

In [12]:
data2=data[(data.salary >15000)]

In [9]:
data2.head(2)

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,1987-06-17,AD_PRES,24000.0,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,1989-09-21,AD_VP,17000.0,NaN,100.0,90.0

In [11]:
data2.to_sql('sample2',conn, index=False)

3

In [13]:
data2

,employee_id,first_name,last_name,email,phone_number,hire_date,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,1987-06-17,AD_PRES,24000.0,NaN,NaN,90.0
1,101,Neena,Kochhar,NKOCHHAR,515.123.4568,1989-09-21,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,1993-01-13,AD_VP,17000.0,NaN,100.0,90.0

In [20]:
cursor=conn.execute(query)

for i in cursor:
    print(i)

('Steven',)
('Neena',)
('Lex',)
('Alexander',)
('Bruce',)
('David',)
('Valli',)
('Diana',)
('Nancy',)
('Daniel',)

In [14]:
query=('select first_name from employees limit 10 ')

In [15]:
type(query)

str

In [16]:
df=pd.read_sql(query,conn)

In [17]:
df

  first_name
0     Steven
1      Neena
2        Lex
3  Alexander
4      Bruce
5      David
6      Valli
7      Diana
8      Nancy
9     Daniel

In [21]:
conn1 = create_engine('mysql+pymysql://root:password@localhost')

In [23]:
conn1.execute('create database DataBase123')